f=0.15324
H=6000
Xs=38437
Ys=27963.155#初始值
x1=-0.08615
y1=-0.06899
x2=-0.0534
y2=0.08221
x3=-0.01478
y3=-0.07663
x4=0.01046
y4=0.06443#像点坐标
X1 = 36589.41
Y1 = 25273.32
Z1 = 2195.17
X2 = 37631.08
Y2 = 31324.51
Z2 = 728.69
X3 = 39100.97
Y3 = 24934.98
Z3 = 2386.50
X4 = 40426.54
Y4 = 30319.81
Z4 = 757.31
(x1) = -(f * (X1 - Xs) / (Z1 - H))
(y1) = -(f * (Y1 - Ys) / (Z1 - H))
(x2) = -(f * (X2 - Xs) / (Z2 - H))
(y2) = -(f * (Y2 - Ys) / (Z2 - H))
(x3) = -(f * (X3 - Xs) / (Z3 - H))
(y3) = -(f * (Y3 - Ys) / (Z3 - H))
(x4) = -(f * (X4 - Xs) / (Z4 - H))
(y4) = -(f * (Y4 - Ys) / (Z4 - H))
#近似坐标

a=-(f/H)
c=-(x1/H)
d=-(f*(1+(x1**2/f**2)))
E=-(x1*y1)/f
F=y1
i=-(y1/H)
k=-(f*(1+(y1**2/f**2)))
l=-x1
print("a=",a,"c=",c,"d=",d,"e=",E,"F=",F,"i=",i,"k=",k,"l=",l)
m=a
o=-(x2/H)
p=-(f*(1+(x2**2/f**2)))
q=-(x2*y2)/f
r=y2
u=-(y2/H)
w=-(f*(1+(y2**2/f**2)))
x=-x2
print("m=",m,"o=",o,"p=",p,"q=",q,"r=",r,"u=",u,"w=",w,"x=",x)
y=a
A=-(x3/H)
B=-(f*(1+(x3**2/f**2)))
C=-(x3*y3)/f
D=y3
G=-(y3/H)
I=-(f*(1+(y3**2/f**2)))
J=-x3
print("y=",y,"A=",A,"B=",B,"C=",C,"D=",D,"G=",G,"I=",I,"J=",J)
K=a
M=-(x4/H)
N=-(f*(1+(x4**2/f**2)))
O=-(x4*y4)/f
P=y4
S=-(y4/H)
U=-(f*(1+(y4**2/f**2)))
V=-x4
print("K=",K,"M=",M,"N=",N,"O=",O,"P",P,"S=",S,"U",U,"V=",V)
#开始计算ATA
a11=K**2+a**2+m**2+y**2
a12=0
a13=K*M+a*c+m*o+A*y
a14=K*N+a*d+m*p+B*y
a15=(K*O+a+m*q+C*y)*E
a16=K*P+a*f+m*r+D*y
a21=a12
a22=a11
a23=K*S+a*i+m*u+G*y
a24=(K*O+a+m*q+C*y)*E
a25=(K+a*k+m*w+y)*I
a26=K*V+a*l+m*x+J*y
a31=a13
a32=a23
a33=(A**2+G**2+M**2+S**2+c**2+o**2+u**2+i**2)
a34=(A*B+C*G+M*N+O*S+c*d+o*p+q*u+i)*E
a35=(A*C+G+M*O+S+c+i*k+o*p+u*w)*E
a36=A*D+G*J+M*P+S*V+c*f+i*l+o*r+u*x
a41=a14
a42=a24
a43=a34
a44=(B**2+C**2+N**2+O**2+d**2+p**2+q**2+1)*E
a45=(B*C+C+N*O+O+d+k+p*q+q*w)*E
a46=(B*D+C*J+N*P+O*V+d*f+l+p*r+q*x)*E
a51=a15
a52=a25
a53=a35
a54=a45
a55=(C**2+O**2+k**2+q**2+w**2+3)*E
a56=(C*D+J+O*P+V+f+k*l+q*r+w*x)*E
a61=a16
a62=a26
a63=a36
a64=a46
a65=a56
a66=D**2+J**2+P**2+V**2+f**2+l**2+r**2+x**2
print("ATA")
print("第一行",a11,a12,a13,a14,a15,a16)
print("第二行",a21,a22,a23,a24,a25,a26)
print("第三行",a31,a32,a33,a34,a35,a36)
print("第四行",a41,a42,a43,a44,a45,a46)
print("第五行",a51,a52,a53,a54,a55,a56)
print("第六行",a61,a62,a63,a64,a65,a66)











